Show / Hide Table of Contents
Class MatConcreteHKG
Material concrete HKG
Inheritance
System.Object
OpenObject
OpenElementId
Material
MatConcrete
MatConcreteHKG
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.Material.HKG.MatConcreteHKG,CI.Material", "CI.StructModel.Libraries.Material.IMaterial,CI.BasicTypes", typeof(MatConcrete))]
public class MatConcreteHKG : MatConcrete
Constructors
Improve this Doc   View Source
MatConcreteHKG()
Constructor
Declaration
public MatConcreteHKG()
Properties
Improve this Doc   View Source
Epscu2
Ultimate compressive strain in the concrete
Declaration
public double Epscu2 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fcu
Compressive strength of concrete
Declaration
public double Fcu { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source